//チューブワーク用統合テンプレート 
// チューブ_外径荒加工径 を最小芯ずれから計算して 外径 + 2R + 2.6としているがこれが正しいのかは検証中
// X{{チューブ_端面始点}}の右側にM99p100時のプレースホルダーが必要なので固有値をまとめ次第追加し結合する
const template_Tube=`%
O{{入力_工程No}}(PM-{{入力_図番}}=No,{{入力_工程No}}=Q)
(TUBE-{{入力_外径}}X{{入力_内径}}-{{入力_長さ}}L-R{{入力_R}})
({{入力_日付}})(ATE={{入力_アテ長さ}})({{入力_作成者}})
{{機械名ヘッダー}}
{{初期設定ブロック}}

N1({{ドリル}}){{扉閉じ}}
G0G40G97S750M3{{ドリルT}}
X0.Z30.{{M51}}
Z3.
{{DRILL_BLOCK}}
G0Z30.{{M59}}
X200.{{M459}}
M1(TSUKAMIKAE)
G28U0W0M1

N2(OUT-ARA){{扉閉じ}}
G0G40G97S750M3{{外径荒}}
X{{最大径-5}}Z30.{{M51}}(-X-)
Z3.

(M99P100){{M99P100}}

G71U4.5R.5
G71P21Q22U0.W0.F.15
N21G0X{{チューブ_外径荒加工径}}
G1Z1.F.15
Z-{{L-0.3}}
N22X{{最大径-5}}(-X-)
N100
G0Z3.
X{{チューブ_端面始点}}{{MC丸}}
G1Z.02F.2
X{{OD+0.1}}F.15
X{{Drill-1}}F.08
G0Z30.{{M59}}
{{M459}}
G28U0W0M1

N3(IN-{{入力_内径}}){{扉閉じ}}
G0G40G97S500{{チューブ内径バイト}}
X{{ID+0.6}}Z30.
M1
M3
Z.1{{M51}}
G1X{{入力_内径}}Z-.2F.05{{M459}}
Z-{{入力_内径深さ}}{{ヨセパス}}
{{チューブ_平底_仕上一行}}
G0Z30.{{M59}}
G28U0W0M1

{{ヨセブロック}}(YOSE Blocks)

N4(OUT-{{入力_外径}}-{{入力_長さ}}L-R{{入力_R}})
G0G40G97S600M3{{外径仕上げバイト}}
X{{OD-0.6}}Z30.{{M51}}
Z.5
G1Z.1F.2
X{{入力_外径}}Z-.2F.05
Z-{{L-R}}
G2X{{OD+2R}}Z-{{L}}R{{入力_R}}
G1U.2S750F.1
G0Z3.

{{M53/M61/M408}}(M53/M61/M408)

{{最大径+角}}
Z-{{L-0.5}}
G1Z-{{L}}F.03
{{最大径+3}}X{{OD+2R+0.1}}F.1(-X-)
G0Z30.{{M59}}
{{M459}}
G28U0W0M1

{{終了設定ブロック}}
%
`;
