const template_G18_655=`
O{{入力_工程No}}(PM-{{入力_図番}}=No,{{入力_工程No}}=Q)
(G18-HGDR-655)
({{入力_日付}})(ATE={{入力_アテ長さ}})({{入力_作成者}})
{{機械名ヘッダー}}
{{初期設定ブロック}}

N1(4.2-HGDR){{扉閉じ}}
G0G40G97S450M3{{ドリルHGDR}}
X0Z30.{{集塵機オン}}
Z3.{{タレットエアーON2}}
{{DRILLSHIAGE_BLOCK}}
G0Z30.{{集塵機オフ}}
G0X200.{{タレットエアーOFF}}
M1(TSUKAMIKAE)
G28U0W0M1

N2(OUT-11.4){{扉閉じ}}
G0G40G97S750M3{{外径荒}}
X{{計算_最大径1}}Z30.{{集塵機オン}}(SAIDAIKEI-5.0)
Z3.

(M99P100){{M99P100}}

G71U4.5R.5
G71P21Q22U6.W.2F.2
N21G0X8.83{{タレットエアーON2}}
G1Z.1
X9.65Z-.3{{タレットエアーOFF}}
Z-10.3
X11.4Z-12.
Z-12.5
G2X12.4Z-13.R.5
N22G1X{{計算_最大径1}}F.35(SAIDAIKEI-5.0)
N100
G0X8.83(C0.3){{タレットエアーON2}}
G1Z.1F.1
X9.65Z-.3F.08{{タレットエアーOFF}}
Z-10.3
X11.4Z-12.
Z-12.5
G2X12.4Z-13.R.5
G1X12.6
{{計算_最大径角}}Z-12.5F.3
Z-13.F.03{{タレットエアーON2}}
{{計算_最大径2}}X12.5F.08{{タレットエアーOFF}}
G0Z0.
G1X2.F.06
G0Z30.M59
G28U0W0M1

N3(IN-6./TPR=1.5){{扉閉じ}}
G0G40G97S500{{内径ダイヤΦ4}}
X6.55Z30.
M1
M3
Z1.{{集塵機オン}}
G1Z.1F.2
Z-{{入力_内径深さ}}F.05
U-.2
G0Z30.{{集塵機オフ}}
G28U0W0M1

N4(IN-TPR){{扉閉じ}}
G0G40G97S500M3{{内径荒}}
X8.051Z30.{{集塵機オン}}
G41Z1.(G41)
G1Z.1F.2{{タレットエアーON2}}
X6.434Z-1.4F.05{{タレットエアーOFF}}
G40U-.15(G40)
G0Z30.{{集塵機オフ}}
G28U0W0M1

{{加工終了信号}}(M53/M61/M408)

N5(G1/8-Z10.335-R.12){{扉閉じ}}
G0G40G97S700M3{{ネジ切り}}
X12.Z30.{{集塵機オン}}
Z5.{{タレットエアーON2}}
G76P010300
G76X8.55Z-10.335P600Q300F.9071
G0Z20.{{集塵機オフ}}
G28U0W0M1

N6(NEJI-MEN){{扉閉じ}}
G0G40G97S750M3{{外径荒}}
X14.Z30.{{集塵機オン}}
M51
Z-.85
G1X10.05F.5{{タレットエアーON2}}
X7.95Z.2F.06{{タレットエアーOFF}}
G0Z30.{{集塵機オフ}}
G28U0W0M1

{{終了設定ブロック}}
`;